УправлениеПаркомАтракционов/src/Documents/ШкалаБонуснойПрограммы/ШкалаБонуснойПрограммы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ШкалаБонуснойПрограммы</name>
  <registerRecords>InformationRegister.АктуальнаяШкалаБонуснойПрограммы</registerRecords>
  <tabularSections>
    <name>Диапозоны</name>
    <attributes>
      <name>НижняяГраница</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВерхняяГраница</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентНакопления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УправлениеПаркомАтракционов/src/InformationRegisters/АктуальнаяШкалаБонуснойПрограммы/АктуальнаяШкалаБонуснойПрограммы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АктуальнаяШкалаБонуснойПрограммы</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Шкала</name>
    <type>
      <types>DocumentRef.ШкалаБонуснойПрограммы</types>
    </type>
  </resources>
</mdclass:InformationRegister>

УправлениеПаркомАтракционов/src/Documents/ШкалаБонуснойПрограммы/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//1.Нижняя граница первого диапозона должна быть равна 0
	//2.Верхняя граница каждого диапозона, кроме последнего, должна быть равна нижней следующего
	//3.Верхняя граница всегда больше нижней границы (кроме последнего диапозона).
	//4.Верхняя граница последнего диапозона должна быть равна 0
	
	Если Диапозоны.Количество() = 0 Тогда		
		Возврат;		
	КонецЕсли; 
	
	Если Диапозоны[0].НижняяГраница <> 0 Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = СтрШаблон("Нижняя граница первого диапозона должна быть равна 0");
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Поле = "Диапозоны[0].НижняяГраница";
		Сообщение.Сообщить();
	КонецЕсли;
	
	ВерхняяГраницаПредыдущегоДиапозона = 0;
	
	Для Сч = 0 По Диапозоны.Количество() - 1 Цикл
		
		Диапозон = Диапозоны[Сч];
		
		Если Сч > 0 Тогда
			Если Диапозон.НижняяГраница <> ВерхняяГраницаПредыдущегоДиапозона Тогда
				Отказ = Истина;
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = СтрШаблон("Верхняя граница диапозона должна быть равна нижней границе следующего");
				Сообщение.УстановитьДанные(ЭтотОбъект);
				Сообщение.Поле = СтрШаблон("Диапозоны[%1].НижняяГраница",XMLСтрока(Сч));
				Сообщение.Сообщить();
			КонецЕсли;			
		КонецЕсли;
		
		Если Диапозон.НижняяГраница >= Диапозон.ВерхняяГраница 
		И Сч <> Диапозоны.Количество() - 1 Тогда
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = СтрШаблон("Верхняя граница должна быть больше нижней границы");
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Поле = СтрШаблон("Диапозоны[%1].ВерхняяГраница",XMLСтрока(Сч));
			Сообщение.Сообщить();
		КонецЕсли;
		
		ВерхняяГраницаПредыдущегоДиапозона = Диапозон.ВерхняяГраница;
		
	КонецЦикла;
	
	ПоследнийДиапозон = Диапозоны[Диапозоны.Количество() - 1];
	
	Если ПоследнийДиапозон.ВерхняяГраница <> 0 Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = СтрШаблон("Верхняя граница последнего диапозона должна быть равна 0");
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Поле = СтрШаблон("Диапозоны[%1].ВерхняяГраница",XMLСтрока(Диапозоны.Количество() - 1));
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ,Режим)
	
	// регистр АктуальнаяШкалаБонуснойПрограммы
	Движения.АктуальнаяШкалаБонуснойПрограммы.Записывать = Истина;
	Движение = Движения.АктуальнаяШкалаБонуснойПрограммы.Добавить();
	Движение.Период = Дата;
	Движение.Шкала = Ссылка;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
